src/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Расход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОбязательныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаОбязательногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Расход/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры
	
#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГрафикПлатежейПриИзменении(Элемент)  
	
	УстановитьВидимостьДоступностьЭлементов();
	ЗаполнитьДанныеИзГрафика();
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура УстановитьВидимостьДоступностьЭлементов()

	Элементы.ПредметПлатежа.Видимость = ЗначениеЗаполнено(Объект.ГрафикПлатежей);

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДанныеИзГрафика()
	
	Если ЗначениеЗаполнено(Объект.ГрафикПлатежей) Тогда
		
		Объект.ПредметПлатежа 			= Объект.ГрафикПлатежей.ПредметПлатежа;
		Объект.Контрагент 				= Объект.ГрафикПлатежей.Контрагент;    
		Объект.Кошелек 					= Объект.ГрафикПлатежей.Счет;
		Объект.СтатьяРасхода 			= Объект.ГрафикПлатежей.СтатьяРасхода;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
